# Graphs
----

In [2]:
# Import Libraries
import pandas as pd
import json
import requests
import numpy as np
import matplotlib.pyplot as plt
import datetime as dt

Global Overview: <br>
How have global temperature trends evolved throughout our date range? <br>
Tactic: Chart that shows how temperatures have evolved for each decade in our dataset.

1. Cities (Cities.csv)

In [3]:
cities_df = pd.read_csv("Cleaned Data/Cities.csv")
cities_df.head()

       City  Country  Year  Yearly Average Temperature
0  A Coruña    Spain  1950                   13.450917
1    Aachen  Germany  1950                    9.183750
2   Aalborg  Denmark  1950                    8.225417
3       Aba  Nigeria  1950                   26.702250
4    Abadan     Iran  1950                   24.538083

2. Countries (Countries.csv)

In [4]:
countries_df = pd.read_csv("Cleaned Data/Countries.csv")
countries_df.head()

   Unnamed: 0         Country  Year  Yearly Average Temperature
0       32691     Afghanistan  1950                   13.043500
1       32692          Africa  1950                   23.880833
2       32693         Albania  1950                   13.812833
3       32694         Algeria  1950                   22.781833
4       32695  American Samoa  1950                   26.520083